# Panads Cont.

## Recap:

- Imported `pandas`
- Created a `DataFrame`
- Counted the no. of rows and columns in our `DataFrame`
- Displayed the first 3 rows of our `DataFrame`

### Task:

1. We are given a DataFrame
2. We want to filter it by `student_id = 101`
3. We want to return the columns: `name` and `age`

In [37]:
student_data = [
    [101, 'Ulysses', 13],
    [53, 'William', 10],
    [128, 'Henry', 6],
    [3, 'Henry', 11],
]

In [39]:
student_data_columns = ['student_id', 'name', 'age']

In [41]:
import pandas as pd

In [43]:
df = pd.DataFrame(data=student_data, columns=student_data_columns)

In [45]:
df

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

To select a specific column from our `df`, we can do: `df['name_of_column']`

In [56]:
df['student_id']

0    101
1     53
2    128
3      3
Name: student_id, dtype: int64

In [62]:
df['student_id'] == 101

0     True
1    False
2    False
3    False
Name: student_id, dtype: bool

In [76]:
df.loc[df['student_id'] == 101, ['name', 'age']]

      name  age
0  Ulysses   13

### ^ New function: `.loc()`

The first argument is the condition would want to filter by.

Ex: `df['student_id'] == 101`

The second argument is the columns that you want to display.

Ex: `['name', 'age']`

### New Task:

- Create a new column in `student_data` `DataFrame` called `age_in_dog_years`
- For the values of `age_in_dog_years`, multiply `age` * 7.5

In [86]:
df

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

In [89]:
df['age']

0    13
1    10
2     6
3    11
Name: age, dtype: int64

In [96]:
# Create a new column:
# Access age values and multiply by 7.5

df['age_in_dog_years'] = df['age'] * 7.5

In [98]:
df

   student_id     name  age  age_in_dog_years
0         101  Ulysses   13              97.5
1          53  William   10              75.0
2         128    Henry    6              45.0
3           3    Henry   11              82.5

## Checkpoint:

1. Once we have out `df` (or table), we want to focus in on a specific column. For example, `student_id`
2. We want to filter rows based on a condition (`stdudent_id == 101`). For this, we introduced a new function `.loc()`.
3. `.loc()` takes in 2 arguments (variables). The first argument is the condition you want to filter your rows by. The second argumnet is the columns that you want to display for your new subset.
4. Created a new column and used the values of an already existing column to populate the values for our new column.

In [100]:
df

   student_id     name  age  age_in_dog_years
0         101  Ulysses   13              97.5
1          53  William   10              75.0
2         128    Henry    6              45.0
3           3    Henry   11              82.5

In [103]:
df['student_id']

0    101
1     53
2    128
3      3
Name: student_id, dtype: int64